Revit 2024 API
BuiltInFailures.RoomFailures.RoomBoundaryMisalignment Property
 [Room] bounding element might be misaligned.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RoomBoundaryMisalignment { get; }
Visual Basic
Public Shared ReadOnly Property RoomBoundaryMisalignment As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RoomBoundaryMisalignment {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace